Tekla Open API Reference for Tekla Structures 2025
ReferenceModelObjectAttributeEnumerator Methods
The ReferenceModelObjectAttributeEnumerator type exposes the following members.
Methods
Name | Description
MoveNext
 Moves to the next reference model object attribute.
Reset
 Resets the enumerator.
Top
See Also
Reference
ReferenceModelObjectAttributeEnumerator Class
Tekla.Structures.Model.Collaboration Namespace